/*----------------------------------------------------------------
// Copyright (C) 2011 永新软件技术工作室
// 版权所有。 
//
// 文件名：IUpdate.cs
// 文件功能描述：更新数据接口
//
// 
// 创建标识：2012-09-09 蒋勇
//
// 修改标识：
// 修改描述：
//
//
//----------------------------------------------------------------*/

namespace ICommonAccess
{
    /// <summary>
    /// 加载对象接口
    /// </summary>
    public interface ILoad<T, T1>
    {

        /// <summary>
        /// 使用ID号加载对象
        /// </summary>
        /// <param name="code">编码</param>
        T Load(T1 code);
    }

}